examples/buoyantPimpleFoam-ccx-FRSR/Fluid/system/changeDictionary-1
// Re = 500, Pr = 0.01, k = 1
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      changeDictionaryDict;
}

dictionaryReplacement
{
    thermophysicalProperties
    {
        mixture
        {
        	specie
        	{
        		molWeight       24.0998901449;
        	}
        	thermodynamics
        	{
        		Cp              5000.0;
        	}
        	transport
        	{
        		mu              0.0002;
        		Pr              0.01; 
        	}
        }
    }
}
